export const Templates = {
  0: {
    title: "snack_contract",
    txt: 
`**สัญญาซื้อขายขนม**  [ตัวเลือกขนม:Choice("ทาโร่","ซูกัส","จอลลี่โคล่า")] **[สัญญาซื้อขายขนม:ตัวเลือกขนม]**
**ข้อ 1.** ผู้ขายตกลงขายและผู้ซื้อตกลงซื้อขนมของผู้ขาย จำนวน **[จำนวนสินค้าที่สั่งซื้อ]** ชิ้น รวมเป็นเงิน **[จำนวนเงิน]** บาท 
**ข้อ 2.** สำหรับราคาสินค้าส่วนนั้นผู้ซื้อตกลงชำระให้แก่ผู้ขายภายในวันที่ **[กำหนดชำระเงิน:Date]**
**ข้อ 3.** หากผู้ขายได้รับเงินแล้ว จะต้องดำเนินการส่งสินค้าภายในเวลา **[จัดส่งภายใน]** วัน
**ข้อ 4.** หากคู่สัญญาฝ่ายหนึ่งฝ่ายใดผิดสัญญา ให้อีกฝ่ายหนึ่งมีสิทธิบอกเลิกสัญญาและมีสิทธิเรียกร้องค่าเสียหายจากฝ่ายที่ผิดสัญญาได้ตามความเป็นจริง
ลงวันที่ **[วันที่:Date]**
ลงชื่อ **[ชื่อผู้ขาย]** ผู้ขาย
ลงชื่อ **[ชื่อผู้ซื้อ]** ผู้ซื้อ

`
  },
 1: {
  title: "lease_contract_1",
  txt:
   `  --------------------------------------------------------------------  หนังสือสัญญาเช่า ----------------------------------------------------------------------------

โดยหนังสือฉบับนี้ ข้าพเจ้า **[ผู้ให้เช่า:VC]**  ซึ่งต่อไปในสัญญานี้เรียกว่า  “ผู้ให้เช่า”  
กับข้าพเจ้า **[ผู้เช่า:VC]** ถือบัตรประชาชนเลขที่ **[บัตรประชาชน:VC]** เกิดวันที่ **[วันเกิด:VC]** ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้เช่า”  
 ทังสองฝ่ายตกลงทำสัญญากันโดยมีข้อความดังต่อไปนี คือ

 **ข้อ  1.**  ผู้ให้เช่าตกลงให้เชาและผู้เช่าตกลงเช่าบ้านโดยมีวัตถุประสงค์เพื่อการเป็นการอยู่อาศัย มีกำหนดเวลาเช่า **[ระยะเวลาเช่า(ปี)]** ปี  เริ่มตั้งแต่วันที่ **[วันเริ่มเช่า]** โดยผู้เช่าตกลงให้ค่าเช่าแก่ผู้ให้เช่าเป็นรายเดือนละ **[ค่าเช่าต่อเดือน]** บาท ส่วนเงินคาภาษีอันเกิดจากทรัพย์สินที่เช่านี ให้ผู้ให้เช่าเป็นผู้เสีย 
 
 **ข้อ  2.**  ผู้เช่าได้ตรวจดูทรัพย์สินที่เช่าแล้ว เห็นว่าทุกสิงอยูในสภาพเรียบร้อยใช้การได้อย่างสมบูรณ์จะดูแลทรัพย์สิน ที่เช่ามิได้ให้สูญหาย และบำรุงรักษาให้อยูในสภาพดีอยูเสมอพร้อมที่จะส่งมอบคืนตามสภาพเดิมทุกประการและตกลงยอมให้ผู้ให้เช่าหรือตัวแทนเข้าตรวจดูทรัพย์สินที่เช่าได้ทุกเวลาภายหลังที่ได้แจ้งความประสงค์ให้ผู้เช่าทราบแล้ว 
 
 **ข้อ  3.**  ผู้เช่าไมมีสิทธินำทรัพย์สินที่เช่าออกให้ผู้อื่นเช่าช่วงหรือทำนิติกรรมใดๆกับผู้อื่นในอันที่จะเป็นผลก่อให้เกิดความผูกพันในทรัพย์สินที่เช่าไม่ว่าโดยตรงหรือโดยปริยายและจะไม่ทำการดัดแปลงหรือต่อเติมทรัพย์สินที่เช่าไม่ว่าทังหมดหรือบางส่วน   เว้นแต่จะได้รับความยินยอมเป็นหนังสือจากผู้ให้เช่าและหากผู้เชาได้ทำการดัดแปลงหรือต่อเติมสิ่งใดตามที่ได้รับความยินยอมเมื่อใดแล้ว ผู้เช่ายอมยกกรรมสิทธิในทรัพย์สินสิ่งนั้นให้ตกเป็นของผู้ให้เช่านับแต่เมื่อนั่นด้วยทั่งสิ้น 
 
 **ข้อ  4.**  เมื่อผู้เช่ากระทำผิดสัญญาข้อหนึ่งข้อใด   ผู้ให้เช่ามีสิทธิบอกเลิกสัญญาได้ทันทีและผู้เช่ายอมชดใช้ค่าธรรมเนียมกับค่าทนายความ ค่าพาหนะและค่าใช้จายในการติดตามทวงถามให้แก่ผู้ให้เช่าจนครบถ้วนหากมีความเสียหายดังกล่าวเกิดขึนเพราะผู้เช่าเป็นฝ่ายผิดสัญญา 
 
 คู่สัญญาได้อ่านและเข้าใจข้อความดีแล้วจึงลงลายมือชื่อไว้เป็นสำคัญต่อหน้าพยาน
  `,
  smartcontract: {startDate:5,duration:3,rent:6}
 }
};

