export const Templates = {
  0: {
    title: "snack_contract",
    txt: `**สัญญาซื้อขายขนม**  [[ตัวเลือกขนม:Choice("ทาโร่","ซูกัส","จอลลี่โคล่า")]] **[[สัญญาซื้อขายขนม:ตัวเลือกขนม]]**

**ข้อ 1.** ผู้ขายตกลงขายและผู้ซื้อตกลงซื้อขนมของผู้ขาย จำนวน **[[จำนวนสินค้าที่สั่งซื้อ]]** ชิ้น รวมเป็นเงิน **[[จำนวนเงิน]]** บาท 

**ข้อ 2.** สำหรับราคาสินค้าส่วนนั้นผู้ซื้อตกลงชำระให้แก่ผู้ขายภายในวันที่ **[[กำหนดชำระเงิน:Date]]**

**ข้อ 3.** หากผู้ขายได้รับเงินแล้ว จะต้องดำเนินการส่งสินค้าภายในเวลา **[[จัดส่งภายใน]]** วัน

**ข้อ 4.** หากคู่สัญญาฝ่ายหนึ่งฝ่ายใดผิดสัญญา ให้อีกฝ่ายหนึ่งมีสิทธิบอกเลิกสัญญาและมีสิทธิเรียกร้องค่าเสียหายจากฝ่ายที่ผิดสัญญาได้ตามความเป็นจริง


ลงวันที่ **[[วันที่:Date]]**

 ลงชื่อ **[[ชื่อผู้ขาย]]** ผู้ขาย

 ลงชื่อ **[[ชื่อผู้ซื้อ]]** ผู้ซื้อ
`
  },
};

